bench/results/sharegpt_7.2b_fp16_3090_r16.log
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(
benchmark_args=Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=30000, ready_check_timeout_sec=60, dataset_name='sharegpt', dataset_path='/tmp/sharegpt.json', speed_bench_category=None, speed_bench_output_len=512, model='/models/rwkv7-7.2b-fla', served_model_name=None, tokenizer='/models/rwkv7-7.2b-fla', num_prompts=500, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=16.0, use_trace_timestamps=False, max_concurrency=None, output_file='/tmp/sharegpt_7.2b_fp16_3090_r16.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=1, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://0.0.0.0:30000/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=30000, ready_check_timeout_sec=60, dataset_name='sharegpt', dataset_path='/tmp/sharegpt.json', speed_bench_category=None, speed_bench_output_len=512, model='/models/rwkv7-7.2b-fla', served_model_name=None, tokenizer='/models/rwkv7-7.2b-fla', num_prompts=500, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=16.0, use_trace_timestamps=False, max_concurrency=None, output_file='/tmp/sharegpt_7.2b_fp16_3090_r16.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=1, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 161035
#Output tokens: 98420
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 500/500 [02:13<00:00,  3.73it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    16.0      
Max request concurrency:                 not set   
Successful requests:                     500       
Benchmark duration (s):                  133.94    
Total input tokens:                      161035    
Total input text tokens:                 161035    
Total generated tokens:                  98420     
Total generated tokens (retokenized):    98235     
Request throughput (req/s):              3.73      
Input token throughput (tok/s):          1202.25   
Output token throughput (tok/s):         734.78    
Peak output token throughput (tok/s):    2091.00   
Peak concurrent requests:                396       
Total token throughput (tok/s):          1937.03   
Concurrency:                             178.65    
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   47857.99  
Median E2E Latency (ms):                 46412.30  
P90 E2E Latency (ms):                    80713.31  
P95 E2E Latency (ms):                    88768.88  
P99 E2E Latency (ms):                    103162.04 
---------------Time to First Token----------------
Mean TTFT (ms):                          23953.55  
Median TTFT (ms):                        20175.91  
P90 TTFT (ms):                           51353.17  
P95 TTFT (ms):                           55446.61  
P99 TTFT (ms):                           58867.97  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          199.80    
Median TPOT (ms):                        133.71    
P90 TPOT (ms):                           225.48    
P95 TPOT (ms):                           615.19    
P99 TPOT (ms):                           1623.68   
---------------Inter-Token Latency----------------
Mean ITL (ms):                           122.13    
Median ITL (ms):                         56.66     
P90 ITL (ms):                            243.45    
P95 ITL (ms):                            311.74    
P99 ITL (ms):                            525.87    
Max ITL (ms):                            14834.17  
==================================================