bench/results/sharegpt_7.2b_fp16_5090_r16.log
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(
benchmark_args=Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=30070, ready_check_timeout_sec=60, dataset_name='sharegpt', dataset_path='/data/bench5090/data/sharegpt.json', speed_bench_category=None, speed_bench_output_len=512, model='/data/models/rwkv7-7.2b-fla', served_model_name=None, tokenizer=None, num_prompts=500, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=16.0, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://0.0.0.0:30070/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=30070, ready_check_timeout_sec=60, dataset_name='sharegpt', dataset_path='/data/bench5090/data/sharegpt.json', speed_bench_category=None, speed_bench_output_len=512, model='/data/models/rwkv7-7.2b-fla', served_model_name=None, tokenizer=None, num_prompts=500, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=16.0, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 198233
#Output tokens: 110378
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 500/500 [00:43<00:00, 11.57it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    16.0      
Max request concurrency:                 not set   
Successful requests:                     500       
Benchmark duration (s):                  43.24     
Total input tokens:                      198233    
Total input text tokens:                 198233    
Total generated tokens:                  110378    
Total generated tokens (retokenized):    109678    
Request throughput (req/s):              11.56     
Input token throughput (tok/s):          4584.71   
Output token throughput (tok/s):         2552.81   
Peak output token throughput (tok/s):    6301.00   
Peak concurrent requests:                188       
Total token throughput (tok/s):          7137.52   
Concurrency:                             100.07    
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   8653.59   
Median E2E Latency (ms):                 6279.72   
P90 E2E Latency (ms):                    20646.92  
P95 E2E Latency (ms):                    24293.61  
P99 E2E Latency (ms):                    30960.23  
---------------Time to First Token----------------
Mean TTFT (ms):                          206.18    
Median TTFT (ms):                        114.81    
P90 TTFT (ms):                           507.03    
P95 TTFT (ms):                           701.73    
P99 TTFT (ms):                           1385.63   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          42.86     
Median TPOT (ms):                        39.43     
P90 TPOT (ms):                           60.31     
P95 TPOT (ms):                           74.66     
P99 TPOT (ms):                           165.43    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           38.65     
Median ITL (ms):                         23.97     
P90 ITL (ms):                            57.77     
P95 ITL (ms):                            103.74    
P99 ITL (ms):                            305.42    
Max ITL (ms):                            1875.57   
==================================================